# GetNumLineTypeItems

## Description
Returns the number of line types in the line style control.

```pascal
FUNCTION GetNumLineTypeItems(
				dialogID : LONGINT;
				itemID   : LONGINT) : INTEGER;
```

```python

def vs.GetNumLineTypeItems(dialogID, itemID):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The index of the dialog layout containing the control.|
|itemID|LONGINT|The index of the line style control.|

## Version
Availability: from Vectorworks 2015
## Category
* Dialogs - Modern